JorgeGzm/hal_gigadevice/include/dt-bindings/pinctrl/gd32vw553k(m)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ANALOG */
#define ANALOG_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define ANALOG_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define ANALOG_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define ANALOG_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define ANALOG_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)
#define ANALOG_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)
#define ANALOG_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)
#define ANALOG_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)
#define ANALOG_PA8 \
	GD32_PINMUX_AF('A', 8, ANALOG)
#define ANALOG_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)
#define ANALOG_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)
#define ANALOG_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)
#define ANALOG_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)
#define ANALOG_PA13 \
	GD32_PINMUX_AF('A', 13, ANALOG)
#define ANALOG_PA14 \
	GD32_PINMUX_AF('A', 14, ANALOG)
#define ANALOG_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)
#define ANALOG_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)
#define ANALOG_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)
#define ANALOG_PB3 \
	GD32_PINMUX_AF('B', 3, ANALOG)
#define ANALOG_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)
#define ANALOG_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)
#define ANALOG_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)
#define ANALOG_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)
#define ANALOG_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)
#define ANALOG_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)
#define ANALOG_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)
#define ANALOG_PC8 \
	GD32_PINMUX_AF('C', 8, ANALOG)
#define ANALOG_PC14 \
	GD32_PINMUX_AF('C', 14, ANALOG)
#define ANALOG_PC15 \
	GD32_PINMUX_AF('C', 15, ANALOG)

/* I2C0_SCL */
#define I2C0_SCL_PA2 \
	GD32_PINMUX_AF('A', 2, AF4)
#define I2C0_SCL_PA15 \
	GD32_PINMUX_AF('A', 15, AF4)
#define I2C0_SCL_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)
#define I2C0_SCL_PB15 \
	GD32_PINMUX_AF('B', 15, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define I2C0_SDA_PA8 \
	GD32_PINMUX_AF('A', 8, AF5)
#define I2C0_SDA_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define I2C0_SDA_PC8 \
	GD32_PINMUX_AF('C', 8, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PA13 \
	GD32_PINMUX_AF('A', 13, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define I2C1_SCL_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)
#define I2C1_SCL_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)
#define I2C1_SCL_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define I2C1_SCL_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)

/* I2C1_SDA */
#define I2C1_SDA_PA7 \
	GD32_PINMUX_AF('A', 7, AF0)
#define I2C1_SDA_PA8 \
	GD32_PINMUX_AF('A', 8, AF6)
#define I2C1_SDA_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define I2C1_SDA_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define I2C1_SDA_PC8 \
	GD32_PINMUX_AF('C', 8, AF6)

/* I2C1_SMBA */
#define I2C1_SMBA_PA14 \
	GD32_PINMUX_AF('A', 14, AF4)

/* SPI_MISO */
#define SPI_MISO_PA1 \
	GD32_PINMUX_AF('A', 1, AF5)
#define SPI_MISO_PA5 \
	GD32_PINMUX_AF('A', 5, AF4)
#define SPI_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI_MISO_PA10 \
	GD32_PINMUX_AF('A', 10, AF0)

/* SPI_MOSI */
#define SPI_MOSI_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define SPI_MOSI_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define SPI_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI_MOSI_PA9 \
	GD32_PINMUX_AF('A', 9, AF0)

/* SPI_NSS */
#define SPI_NSS_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define SPI_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI_NSS_PA7 \
	GD32_PINMUX_AF('A', 7, AF4)
#define SPI_NSS_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)

/* SPI_SCK */
#define SPI_SCK_PA2 \
	GD32_PINMUX_AF('A', 2, AF5)
#define SPI_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI_SCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF7)
#define SPI_SCK_PA11 \
	GD32_PINMUX_AF('A', 11, AF0)

/* UART1_CTS */
#define UART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)

/* UART1_RTS */
#define UART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)

/* UART1_RX */
#define UART1_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)

/* UART1_TX */
#define UART1_TX_PB15 \
	GD32_PINMUX_AF('B', 15, AF7)

/* UART2_CTS */
#define UART2_CTS_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)

/* UART2_RTS */
#define UART2_RTS_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)

/* UART2_RX */
#define UART2_RX_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)

/* UART2_TX */
#define UART2_TX_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)

/* USART0_CTS */
#define USART0_CTS_PA2 \
	GD32_PINMUX_AF('A', 2, AF0)

/* USART0_RTS */
#define USART0_RTS_PA3 \
	GD32_PINMUX_AF('A', 3, AF0)

/* USART0_RX */
#define USART0_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)
#define USART0_RX_PB15 \
	GD32_PINMUX_AF('B', 15, AF8)

/* USART0_TX */
#define USART0_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF0)
#define USART0_TX_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
